training:
	time_start: 9.2.2019: 14:16.9
	time_end: 10.2.2019: 10:34.56

loss:
	last_training: (20, 48.40649958583287)
	min_training: (12, 4.160778196334839)
	min_testing: (20, 80.86942215983073)
	last_testing: (20, 80.86942215983073)

network: 
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
inp_1s (InputLayer)             (None, 4096, 2)      0                                            
__________________________________________________________________________________________________
inp_2s (InputLayer)             (None, 4096, 2)      0                                            
__________________________________________________________________________________________________
inp_4s (InputLayer)             (None, 4096, 2)      0                                            
__________________________________________________________________________________________________
inp_8s (InputLayer)             (None, 4096, 2)      0                                            
__________________________________________________________________________________________________
inp_16s (InputLayer)            (None, 4096, 2)      0                                            
__________________________________________________________________________________________________
inp_32s (InputLayer)            (None, 4096, 2)      0                                            
__________________________________________________________________________________________________
inp_64s (InputLayer)            (None, 4096, 2)      0                                            
__________________________________________________________________________________________________
conv1d_1 (Conv1D)               (None, 4081, 16)     528         inp_1s[0][0]                     
__________________________________________________________________________________________________
conv1d_2 (Conv1D)               (None, 4065, 16)     1040        inp_2s[0][0]                     
__________________________________________________________________________________________________
conv1d_3 (Conv1D)               (None, 4033, 16)     2064        inp_4s[0][0]                     
__________________________________________________________________________________________________
conv1d_4 (Conv1D)               (None, 3969, 16)     4112        inp_8s[0][0]                     
__________________________________________________________________________________________________
conv1d_5 (Conv1D)               (None, 3841, 16)     8208        inp_16s[0][0]                    
__________________________________________________________________________________________________
conv1d_6 (Conv1D)               (None, 3585, 16)     16400       inp_32s[0][0]                    
__________________________________________________________________________________________________
conv1d_7 (Conv1D)               (None, 3073, 16)     32784       inp_64s[0][0]                    
__________________________________________________________________________________________________
conv1d_8 (Conv1D)               (None, 4066, 32)     8224        conv1d_1[0][0]                   
__________________________________________________________________________________________________
conv1d_9 (Conv1D)               (None, 4034, 32)     16416       conv1d_2[0][0]                   
__________________________________________________________________________________________________
conv1d_10 (Conv1D)              (None, 3970, 32)     32800       conv1d_3[0][0]                   
__________________________________________________________________________________________________
conv1d_11 (Conv1D)              (None, 3842, 32)     65568       conv1d_4[0][0]                   
__________________________________________________________________________________________________
conv1d_12 (Conv1D)              (None, 3586, 32)     131104      conv1d_5[0][0]                   
__________________________________________________________________________________________________
conv1d_13 (Conv1D)              (None, 3074, 32)     262176      conv1d_6[0][0]                   
__________________________________________________________________________________________________
conv1d_14 (Conv1D)              (None, 2050, 32)     524320      conv1d_7[0][0]                   
__________________________________________________________________________________________________
max_pooling1d_1 (MaxPooling1D)  (None, 1016, 32)     0           conv1d_8[0][0]                   
__________________________________________________________________________________________________
max_pooling1d_2 (MaxPooling1D)  (None, 1008, 32)     0           conv1d_9[0][0]                   
__________________________________________________________________________________________________
max_pooling1d_3 (MaxPooling1D)  (None, 992, 32)      0           conv1d_10[0][0]                  
__________________________________________________________________________________________________
max_pooling1d_4 (MaxPooling1D)  (None, 960, 32)      0           conv1d_11[0][0]                  
__________________________________________________________________________________________________
max_pooling1d_5 (MaxPooling1D)  (None, 896, 32)      0           conv1d_12[0][0]                  
__________________________________________________________________________________________________
max_pooling1d_6 (MaxPooling1D)  (None, 768, 32)      0           conv1d_13[0][0]                  
__________________________________________________________________________________________________
max_pooling1d_7 (MaxPooling1D)  (None, 512, 32)      0           conv1d_14[0][0]                  
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 32512)        0           max_pooling1d_1[0][0]            
__________________________________________________________________________________________________
flatten_2 (Flatten)             (None, 32256)        0           max_pooling1d_2[0][0]            
__________________________________________________________________________________________________
flatten_3 (Flatten)             (None, 31744)        0           max_pooling1d_3[0][0]            
__________________________________________________________________________________________________
flatten_4 (Flatten)             (None, 30720)        0           max_pooling1d_4[0][0]            
__________________________________________________________________________________________________
flatten_5 (Flatten)             (None, 28672)        0           max_pooling1d_5[0][0]            
__________________________________________________________________________________________________
flatten_6 (Flatten)             (None, 24576)        0           max_pooling1d_6[0][0]            
__________________________________________________________________________________________________
flatten_7 (Flatten)             (None, 16384)        0           max_pooling1d_7[0][0]            
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 196864)       0           flatten_1[0][0]                  
                                                                 flatten_2[0][0]                  
                                                                 flatten_3[0][0]                  
                                                                 flatten_4[0][0]                  
                                                                 flatten_5[0][0]                  
                                                                 flatten_6[0][0]                  
                                                                 flatten_7[0][0]                  
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 16)           3149840     concatenate_1[0][0]              
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 1)            17          dense_1[0][0]                    
==================================================================================================
Total params: 4,255,601
Trainable params: 4,255,601
Non-trainable params: 0
__________________________________________________________________________________________________


loss:
	last_training: (20, 48.40649958583287)
	min_training: (12, 4.160778196334839)
	min_testing: (20, 80.86942215983073)
	last_testing: (20, 80.86942215983073)

template_properties:
	data_shape: [4096   14]
	seed: 12345
	gw_prob: 1.0
	whiten_len: 4.0
	coa_phase: 0.0
	resample_delta_t: [0.00024414 0.00048828 0.00097656 0.00195312 0.00390625 0.0078125
 0.015625  ]
	random_starting_time: True
	polarization: 0.0
	t_len: 96.0
	whiten_cutoff: 4.0
	f_lower: 20.0
	delta_t: 0.000244140625
	train_to_test: 0.7
	label_shape: [1]
	num_of_templates: 10000
	snr: [10. 50.]
	path: /home/marlin/Documents/Documents/Studium/Masterarbeit/Forschungsphase/Code/Git/master_project/bns_net/saves
	distance: 1.0
	resample_t_len: [ 1.  2.  4.  8. 16. 32. 64.]
	mass1: 1.4
	mass2: 1.4
	detectors: ['H1' 'L1']
	right_ascension: 0.0
	approximant: TaylorF2
	declination: 0.0
	end_time: 7693098
	t_from_right: 0.5
	time_offset: [-0.25  0.25]

programm_internals:
	loss: mean_squared_error
	optimizer: adam
	only_print_image: False
	temp_path: /home/marlin/Documents/Documents/Studium/Masterarbeit/Forschungsphase/Code/Git/master_project/bns_net/saves
	overwrite_template_file: False
	epochs: 20
	net_path: /home/marlin/Documents/Documents/Studium/Masterarbeit/Forschungsphase/Code/Git/master_project/bns_net/saves
	create_wiki_entry: True
	ignore_fixable_errors: False
	metrics: ['mape']
	overwrite_net_file: True
	show_snr_plot: True
	use_custom_train_function: True
	epoch_break: 2
	format_data: True

template_generation:
	time_start: 9.2.2019: 14:10.49
	time_end: 9.2.2019: 14:10.49

ignored_errors: False

loss_plot_name: collect_net_loss_plot_92201914169.png

SNR_plot_name: collect_net_snr_92201914169.png

###############################################################################


training:
	time_start: 10.2.2019: 11:16.30
	time_end: 11.2.2019: 13:5.35

loss:
	last_training: (20, 9.415607376098633)
	min_training: (20, 9.415607376098633)
	min_testing: (20, 12.842837084452311)
	last_testing: (20, 12.842837084452311)

network: 
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
inp_1s (InputLayer)             (None, 4096, 2)      0                                            
__________________________________________________________________________________________________
inp_2s (InputLayer)             (None, 4096, 2)      0                                            
__________________________________________________________________________________________________
inp_4s (InputLayer)             (None, 4096, 2)      0                                            
__________________________________________________________________________________________________
inp_8s (InputLayer)             (None, 4096, 2)      0                                            
__________________________________________________________________________________________________
inp_16s (InputLayer)            (None, 4096, 2)      0                                            
__________________________________________________________________________________________________
inp_32s (InputLayer)            (None, 4096, 2)      0                                            
__________________________________________________________________________________________________
inp_64s (InputLayer)            (None, 4096, 2)      0                                            
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 4096, 2)      8           inp_1s[0][0]                     
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 4096, 2)      8           inp_2s[0][0]                     
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 4096, 2)      8           inp_4s[0][0]                     
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 4096, 2)      8           inp_8s[0][0]                     
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 4096, 2)      8           inp_16s[0][0]                    
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 4096, 2)      8           inp_32s[0][0]                    
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 4096, 2)      8           inp_64s[0][0]                    
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 4096, 2)      0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 4096, 2)      0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
dropout_3 (Dropout)             (None, 4096, 2)      0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
dropout_4 (Dropout)             (None, 4096, 2)      0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
dropout_5 (Dropout)             (None, 4096, 2)      0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
dropout_6 (Dropout)             (None, 4096, 2)      0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
dropout_7 (Dropout)             (None, 4096, 2)      0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
conv1d_1 (Conv1D)               (None, 4081, 16)     528         dropout_1[0][0]                  
__________________________________________________________________________________________________
conv1d_2 (Conv1D)               (None, 4065, 16)     1040        dropout_2[0][0]                  
__________________________________________________________________________________________________
conv1d_3 (Conv1D)               (None, 4033, 16)     2064        dropout_3[0][0]                  
__________________________________________________________________________________________________
conv1d_4 (Conv1D)               (None, 3969, 16)     4112        dropout_4[0][0]                  
__________________________________________________________________________________________________
conv1d_5 (Conv1D)               (None, 3841, 16)     8208        dropout_5[0][0]                  
__________________________________________________________________________________________________
conv1d_6 (Conv1D)               (None, 3585, 16)     16400       dropout_6[0][0]                  
__________________________________________________________________________________________________
conv1d_7 (Conv1D)               (None, 3073, 16)     32784       dropout_7[0][0]                  
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 4081, 16)     64          conv1d_1[0][0]                   
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 4065, 16)     64          conv1d_2[0][0]                   
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 4033, 16)     64          conv1d_3[0][0]                   
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 3969, 16)     64          conv1d_4[0][0]                   
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 3841, 16)     64          conv1d_5[0][0]                   
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, 3585, 16)     64          conv1d_6[0][0]                   
__________________________________________________________________________________________________
batch_normalization_14 (BatchNo (None, 3073, 16)     64          conv1d_7[0][0]                   
__________________________________________________________________________________________________
conv1d_8 (Conv1D)               (None, 4066, 32)     8224        batch_normalization_8[0][0]      
__________________________________________________________________________________________________
conv1d_9 (Conv1D)               (None, 4034, 32)     16416       batch_normalization_9[0][0]      
__________________________________________________________________________________________________
conv1d_10 (Conv1D)              (None, 3970, 32)     32800       batch_normalization_10[0][0]     
__________________________________________________________________________________________________
conv1d_11 (Conv1D)              (None, 3842, 32)     65568       batch_normalization_11[0][0]     
__________________________________________________________________________________________________
conv1d_12 (Conv1D)              (None, 3586, 32)     131104      batch_normalization_12[0][0]     
__________________________________________________________________________________________________
conv1d_13 (Conv1D)              (None, 3074, 32)     262176      batch_normalization_13[0][0]     
__________________________________________________________________________________________________
conv1d_14 (Conv1D)              (None, 2050, 32)     524320      batch_normalization_14[0][0]     
__________________________________________________________________________________________________
batch_normalization_15 (BatchNo (None, 4066, 32)     128         conv1d_8[0][0]                   
__________________________________________________________________________________________________
batch_normalization_16 (BatchNo (None, 4034, 32)     128         conv1d_9[0][0]                   
__________________________________________________________________________________________________
batch_normalization_17 (BatchNo (None, 3970, 32)     128         conv1d_10[0][0]                  
__________________________________________________________________________________________________
batch_normalization_18 (BatchNo (None, 3842, 32)     128         conv1d_11[0][0]                  
__________________________________________________________________________________________________
batch_normalization_19 (BatchNo (None, 3586, 32)     128         conv1d_12[0][0]                  
__________________________________________________________________________________________________
batch_normalization_20 (BatchNo (None, 3074, 32)     128         conv1d_13[0][0]                  
__________________________________________________________________________________________________
batch_normalization_21 (BatchNo (None, 2050, 32)     128         conv1d_14[0][0]                  
__________________________________________________________________________________________________
max_pooling1d_1 (MaxPooling1D)  (None, 1016, 32)     0           batch_normalization_15[0][0]     
__________________________________________________________________________________________________
max_pooling1d_2 (MaxPooling1D)  (None, 1008, 32)     0           batch_normalization_16[0][0]     
__________________________________________________________________________________________________
max_pooling1d_3 (MaxPooling1D)  (None, 992, 32)      0           batch_normalization_17[0][0]     
__________________________________________________________________________________________________
max_pooling1d_4 (MaxPooling1D)  (None, 960, 32)      0           batch_normalization_18[0][0]     
__________________________________________________________________________________________________
max_pooling1d_5 (MaxPooling1D)  (None, 896, 32)      0           batch_normalization_19[0][0]     
__________________________________________________________________________________________________
max_pooling1d_6 (MaxPooling1D)  (None, 768, 32)      0           batch_normalization_20[0][0]     
__________________________________________________________________________________________________
max_pooling1d_7 (MaxPooling1D)  (None, 512, 32)      0           batch_normalization_21[0][0]     
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 32512)        0           max_pooling1d_1[0][0]            
__________________________________________________________________________________________________
flatten_2 (Flatten)             (None, 32256)        0           max_pooling1d_2[0][0]            
__________________________________________________________________________________________________
flatten_3 (Flatten)             (None, 31744)        0           max_pooling1d_3[0][0]            
__________________________________________________________________________________________________
flatten_4 (Flatten)             (None, 30720)        0           max_pooling1d_4[0][0]            
__________________________________________________________________________________________________
flatten_5 (Flatten)             (None, 28672)        0           max_pooling1d_5[0][0]            
__________________________________________________________________________________________________
flatten_6 (Flatten)             (None, 24576)        0           max_pooling1d_6[0][0]            
__________________________________________________________________________________________________
flatten_7 (Flatten)             (None, 16384)        0           max_pooling1d_7[0][0]            
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 196864)       0           flatten_1[0][0]                  
                                                                 flatten_2[0][0]                  
                                                                 flatten_3[0][0]                  
                                                                 flatten_4[0][0]                  
                                                                 flatten_5[0][0]                  
                                                                 flatten_6[0][0]                  
                                                                 flatten_7[0][0]                  
__________________________________________________________________________________________________
batch_normalization_22 (BatchNo (None, 196864)       787456      concatenate_1[0][0]              
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 16)           3149840     batch_normalization_22[0][0]     
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 1)            17          dense_1[0][0]                    
==================================================================================================
Total params: 5,044,457
Trainable params: 4,650,029
Non-trainable params: 394,428
__________________________________________________________________________________________________


loss:
	last_training: (20, 9.415607376098633)
	min_training: (20, 9.415607376098633)
	min_testing: (20, 12.842837084452311)
	last_testing: (20, 12.842837084452311)

template_properties:
	data_shape: [4096   14]
	seed: 12345
	gw_prob: 1.0
	whiten_len: 4.0
	coa_phase: 0.0
	resample_delta_t: [0.00024414 0.00048828 0.00097656 0.00195312 0.00390625 0.0078125
 0.015625  ]
	random_starting_time: True
	polarization: 0.0
	t_len: 96.0
	whiten_cutoff: 4.0
	f_lower: 20.0
	delta_t: 0.000244140625
	train_to_test: 0.7
	label_shape: [1]
	num_of_templates: 10000
	snr: [10. 50.]
	path: /home/marlin/Documents/Documents/Studium/Masterarbeit/Forschungsphase/Code/Git/master_project/bns_net/saves
	distance: 1.0
	resample_t_len: [ 1.  2.  4.  8. 16. 32. 64.]
	mass1: 1.4
	mass2: 1.4
	detectors: ['H1' 'L1']
	right_ascension: 0.0
	approximant: TaylorF2
	declination: 0.0
	end_time: 7693098
	t_from_right: 0.5
	time_offset: [-0.25  0.25]

programm_internals:
	loss: mean_squared_error
	optimizer: adam
	only_print_image: False
	temp_path: /home/marlin/Documents/Documents/Studium/Masterarbeit/Forschungsphase/Code/Git/master_project/bns_net/saves
	overwrite_template_file: False
	epochs: 20
	net_path: /home/marlin/Documents/Documents/Studium/Masterarbeit/Forschungsphase/Code/Git/master_project/bns_net/saves
	create_wiki_entry: True
	ignore_fixable_errors: False
	metrics: ['mape']
	overwrite_net_file: True
	show_snr_plot: True
	use_custom_train_function: True
	epoch_break: 2
	format_data: True

template_generation:
	time_start: 10.2.2019: 11:10.21
	time_end: 10.2.2019: 11:10.21

ignored_errors: False

loss_plot_name: collect_net_loss_plot_1022019111630.png

SNR_plot_name: collect_net_snr_1022019111630.png

###############################################################################


training:
	time_start: 11.2.2019: 23:6.50
	time_end: 12.2.2019: 1:56.59

loss:
	last_training: (1, 46817516.0)
	min_training: (1, 46817516.0)
	min_testing: (1, 45739792.0)
	last_testing: (1, 45739792.0)

network: 
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d_1 (Conv1D)            (None, 4081, 32)          7200      
_________________________________________________________________
batch_normalization_1 (Batch (None, 4081, 32)          128       
_________________________________________________________________
activation_1 (Activation)    (None, 4081, 32)          0         
_________________________________________________________________
max_pooling1d_1 (MaxPooling1 (None, 1020, 32)          0         
_________________________________________________________________
conv1d_2 (Conv1D)            (None, 1005, 64)          32832     
_________________________________________________________________
batch_normalization_2 (Batch (None, 1005, 64)          256       
_________________________________________________________________
activation_2 (Activation)    (None, 1005, 64)          0         
_________________________________________________________________
max_pooling1d_2 (MaxPooling1 (None, 251, 64)           0         
_________________________________________________________________
conv1d_3 (Conv1D)            (None, 236, 128)          131200    
_________________________________________________________________
batch_normalization_3 (Batch (None, 236, 128)          512       
_________________________________________________________________
activation_3 (Activation)    (None, 236, 128)          0         
_________________________________________________________________
max_pooling1d_3 (MaxPooling1 (None, 59, 128)           0         
_________________________________________________________________
conv1d_4 (Conv1D)            (None, 44, 256)           524544    
_________________________________________________________________
batch_normalization_4 (Batch (None, 44, 256)           1024      
_________________________________________________________________
activation_4 (Activation)    (None, 44, 256)           0         
_________________________________________________________________
max_pooling1d_4 (MaxPooling1 (None, 11, 256)           0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 2816)              0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 2816)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 64)                180288    
_________________________________________________________________
dropout_2 (Dropout)          (None, 64)                0         
_________________________________________________________________
dense_2 (Dense)              (None, 2)                 130       
=================================================================
Total params: 878,114
Trainable params: 877,154
Non-trainable params: 960
_________________________________________________________________


loss:
	last_training: (1, 46817516.0)
	min_training: (1, 46817516.0)
	min_testing: (1, 45739792.0)
	last_testing: (1, 45739792.0)

template_properties:
	data_shape: [4096   14]
	seed: 12345
	gw_prob: 0.5
	whiten_len: 4.0
	no_gw_snr: 4.0
	coa_phase: 0.0
	resample_delta_t: [0.00024414 0.00048828 0.00097656 0.00195312 0.00390625 0.0078125
 0.015625  ]
	random_starting_time: True
	polarization: 0.0
	t_len: 96.0
	whiten_cutoff: 4.0
	f_lower: 20.0
	delta_t: 0.000244140625
	train_to_test: 0.7
	label_shape: [2]
	num_of_templates: 10000
	snr: [10. 50.]
	path: /home/marlin/Documents/Documents/Studium/Masterarbeit/Forschungsphase/Code/Git/master_project/bns_net/saves
	distance: 1.0
	resample_t_len: [ 1.  2.  4.  8. 16. 32. 64.]
	mass1: 1.4
	mass2: 1.4
	detectors: ['H1' 'L1']
	right_ascension: 0.0
	approximant: TaylorF2
	declination: 0.0
	end_time: 7693098
	t_from_right: 0.5
	time_offset: [-0.25  0.25]

programm_internals:
	loss: mean_squared_error
	optimizer: adam
	only_print_image: False
	temp_path: /home/marlin/Documents/Documents/Studium/Masterarbeit/Forschungsphase/Code/Git/master_project/bns_net/saves
	overwrite_template_file: True
	epochs: 50
	net_path: /home/marlin/Documents/Documents/Studium/Masterarbeit/Forschungsphase/Code/Git/master_project/bns_net/saves
	create_wiki_entry: True
	ignore_fixable_errors: False
	metrics: ['mape']
	overwrite_net_file: True
	show_snr_plot: True
	use_custom_train_function: True
	epoch_break: 2
	format_data: False

template_generation:
	time_start: 11.2.2019: 19:26.38
	time_end: 11.2.2019: 23:6.48

ignored_errors: False

loss_plot_name: testing_net_loss_plot_112201923650.png

SNR_plot_name: testing_net_snr_112201923650.png

